Repository: Emmizo/weather_app
Catalog: lib/l10n/app_*.arb
Languages: fr, rw

# appTitle
source: Weather App
fr: Application Météo
rw: Porogaramu y'Ikirere

source: Forecast
fr: Prévisions
rw: Iteganyagihe

source: Next 7 Days
fr: 7 prochains jours
rw: Iminsi 7 Ikurikira

source: Astro & Air Quality
fr: Astro & Qualité de l'air
rw: Igihe cy'izuba & Ubuziranenge bw'ikirere

source: Sunrise
fr: Lever du soleil
rw: Izuba Rirashe

source: Sunset
fr: Coucher du soleil
rw: Izuba Rirenga

source: AQI
fr: IQA

source: Search
fr: Recherche
rw: Shakisha

source: Location
fr: Emplacement
rw: Aho Uherereye

source: Overcast
fr: Couvert
rw: Ibicu byinshi

source: Fog
fr: Brouillard
rw: Igihu

source: Temperature
fr: Température
rw: Ubushyuhe

source: Humidity
fr: Humidité
rw: Ubushuhe

source: Wind
fr: Vent
rw: Umuyaga

source: Select Language
fr: Choisir la langue
rw: Hitamo ururimi

source: Location permission denied.
fr: Autorisation de localisation refusée.
rw: Ururembo rwo kumenya aho uherereye rwanze.

source: Retry Location
fr: Réessayer la localisation
rw: Gerageza Kuhongera

source: Open App Settings
fr: Ouvrir les paramètres de l'application
rw: Fungura Igenamiterere ry'Agashami

source: Search City
fr: Rechercher une ville
rw: Shakisha Umujyi

source: English
fr: Anglais
rw: Icyongereza

source: Current Location
fr: Position actuelle
rw: Aho uherereye ubu

source: Last Known Location
fr: Dernière position connue
rw: Aho uheruka guherereye

source: Saved Locations
fr: Lieux enregistrés
rw: Ahantu hashyizwe mububiko

source: Add Current Location
fr: Ajouter la position actuelle
rw: Ongeraho aho uherereye ubu

source: Manage Locations
fr: Gérer les lieux
rw: Genzura ahantu

source: Light Mode
fr: Mode clair
rw: Uburyo bw'umucyo

source: Dark Mode
fr: Mode sombre
rw: Uburyo bw'umwijima

# showFahrenheit
source: Show °F
fr: Afficher en °F
rw: Erekana °F

# showCelsius
source: Show °C
fr: Afficher en °C
rw: Erekana °C

# noForecastData
source: No forecast data available.
fr: Aucune donnée de prévision disponible.
rw: Nta makuru y'iteganyagihe aboneka.

# windLayer
source: WIND
fr: VENT
rw: UMUYAGA

# rainLayer
source: RAIN
fr: PLUIE
rw: IMVURA

source: Hourly Forecast
fr: Prévisions horaires
rw: Iteganyagihe ry'isaha

source: Daily Forecast
fr: Prévisions journalières
rw: Iteganyagihe ry'umunsi

source: Daily Weather Details
fr: Détails météo journaliers
rw: Amakuru arambuye y'iteganyagihe ry'umunsi

source: UV Index
fr: Indice UV
rw: Igipimo cya UV

# moonPhase
source: Moon
fr: Phase de la lune
rw: Icyiciro cy'ukwezi

# searchCityTitle
source: Search City
fr: Rechercher une ville
rw: Shakisha Umujyi

source: Close
fr: Fermer
rw: Funga

source: Enter city name
fr: Entrez le nom de la ville
rw: Andika izina ry'umujyi

source: Clothing Suggestions
fr: Suggestions de vêtements
rw: Inama ku myambaro

# hotWeather
source: Hot Weather Today
fr: Temps chaud aujourd'hui
rw: Ikirere gishyuhe uyu munsi

# coldWeather
source: Cold Weather Today
fr: Temps froid aujourd'hui
rw: Ikirere gikonje uyu munsi

# rainyWeather
source: Rainy Weather Today
fr: Temps pluvieux aujourd'hui
rw: Ikirere kivuye uyu munsi

# sunnyWeather
source: Sunny Weather Today
fr: Temps ensoleillé aujourd'hui
rw: Ikirere kizuba uyu munsi

# cloudyWeather
source: Cloudy Weather Today
fr: Temps nuageux aujourd'hui
rw: Ikirere kibicu uyu munsi

# hotSuggestion
source: Today: Wear light clothing, shorts, t-shirts, and sandals. Stay hydrated and seek shade.
fr: Aujourd'hui : Portez des vêtements légers, shorts, t-shirts et sandales. Restez hydraté et cherchez l'ombre.
rw: Uyu munsi: Ambara myambaro myoroshye, amashorti, amatishati, n'amasandali. Nywa amazi menshi kandi shaka igicucu.

# coldSuggestion
source: Today: Bundle up with a warm jacket, sweater, long pants, and boots. Layer your clothing.
fr: Aujourd'hui : Couvrez-vous avec une veste chaude, pull, pantalon long et bottes. Superposez vos vêtements.
rw: Uyu munsi: Ambara ikoti gishyuhe, pulo, amapantaloni maremare, n'amabutu. Ambara myambaro myinshi.

# rainySuggestion
source: Today: Bring a raincoat, umbrella, and waterproof shoes. Avoid getting soaked.
fr: Aujourd'hui : Apportez un imperméable, parapluie et chaussures imperméables. Évitez de vous mouiller.
rw: Uyu munsi: Twara ikoti ry'imvura, umutaka, n'amabutu atanyura. Irinde kwuzura.

# sunnySuggestion
source: Today: Wear sunglasses, hat, light clothing, and apply sunscreen. Protect from UV rays.
fr: Aujourd'hui : Portez des lunettes de soleil, chapeau, vêtements légers et appliquez de la crème solaire. Protégez-vous des UV.
rw: Uyu munsi: Ambara amataro y'izuba, ingofero, myambaro myoroshye, kandi ufate amavuta y'izuba. Kiraka imiyoboro ya UV.

# cloudySuggestion
source: Today: A light jacket and comfortable clothing should be sufficient. Weather is mild.
fr: Aujourd'hui : Une veste légère et des vêtements confortables devraient suffire. Le temps est doux.
rw: Uyu munsi: Ikoti gito n'imyambaro myiza bihagije. Ikirere gituye.

# alertsAndTips
source: Today's Alerts & Tips
fr: Alertes et conseils d'aujourd'hui
rw: Impuruza n'Inama z'uyu munsi

# swipeToSeeMore
source: Swipe to see more • Auto-sliding
fr: Glissez pour voir plus • Défilement automatique
rw: Kurura kugira ngo urebe byinshi • Kwerekana mu buryo bwikora

# heavyRainWarningTitle
source: Heavy Rain Warning Today
fr: Alerte fortes pluies aujourd'hui
rw: Impuruza y'Imvura Nyinshi uyu munsi

# heavyRainWarningBody
source: Today: Risk of flash floods. Avoid low-lying areas and riverbanks. Do not drive through flooded roads.
fr: Aujourd'hui : Risque d'inondations soudaines. Évitez les zones basses et les berges. Ne traversez pas les routes inondées.
rw: Uyu munsi: Ibyago by'imyuzure. Irinde ahantu hasi n'inkombe z'inzuzi. Ntugerageze gutwara mu mihanda yuzuyemo amazi.

# thunderstormWarningTitle
source: Thunderstorm Warning Today
fr: Alerte orages aujourd'hui
rw: Impuruza y'Inkuba uyu munsi

# thunderstormWarningBody
source: Today: Seek shelter indoors immediately. Avoid open fields, tall trees, and water. Unplug electronics.
fr: Aujourd'hui : Cherchez un abri à l'intérieur. Évitez les champs, les grands arbres et l'eau. Débranchez les appareils électroniques.
rw: Uyu munsi: Shaka ubwihisho mu nzu ako kanya. Irinde ibibuga, ibiti birebire, n'amazi. Kuramo ibikoresho by'amashanyarazi.

# strongWindAdvisoryTitle
source: Strong Wind Advisory Today
fr: Avis de vent fort aujourd'hui
rw: Inama ku Muyaga Mwinshi uyu munsi

# strongWindAdvisoryBody
source: Today: Secure loose objects outdoors. Be cautious of falling branches. Difficult driving conditions expected.
fr: Aujourd'hui : Attachez les objets extérieurs. Attention aux chutes de branches. Conduite difficile pour les gros véhicules.
rw: Uyu munsi: Hambira ibintu byo hanze bishobora kuguruka. Witondere amashami ashobora kugwa. Abatwaye ibinyabiziga binini bagomba kwitonda.

# extremeHeatAlertTitle
source: Extreme Heat Alert Today
fr: Alerte canicule aujourd'hui
rw: Impuruza y'Ubushyuhe Bwinshi uyu munsi

# extremeHeatAlertBody
source: Today: Stay hydrated and avoid strenuous activity. Seek cool, shaded areas, especially during peak hours.
fr: Aujourd'hui : Hydratez-vous et évitez les efforts intenses à l'extérieur aux heures de pointe. Cherchez l'ombre.
rw: Uyu munsi: Nywa amazi menshi kandi wirinde imirimo ivunanye hanze ku zuba ryinshi. Shaka ahantu hari igicucu.

# poorAirQualityTitle
source: Poor Air Quality Today
fr: Qualité de l'air médiocre aujourd'hui
rw: Ubuziranenge bw'Umwuka Bujegejege uyu munsi

# poorAirQualityBody
source: Today: Sensitive groups should limit outdoor exertion. Consider wearing a mask if you have respiratory issues.
fr: Aujourd'hui : Les groupes sensibles doivent limiter l'effort extérieur. Portez un masque si vous avez des problèmes respiratoires.
rw: Uyu munsi: Abafite ibyago by'indwara z'ubuhumekero bagomba kugabanya ingendo zo hanze. Tekereza kwambara agapfukamunwa.

# farmingPredictions
source: 16-Day Farming Outlook
fr: Prévisions agricoles 16 jours
rw: Ubusobanura bw'Ubuhinzi bw'Iminsi 16

# rainySeasonAheadTitle
source: Rainy Season Ahead
fr: Saison des Pluies à Venir
rw: Igi cy'Imvura Kigeze

# rainySeasonAheadBody
source: Next 16 days: Prepare for upcoming rainy season. Consider planting rain-fed crops and ensure proper drainage systems.
fr: 16 prochains jours : Préparez-vous pour la saison des pluies. Considérez planter des cultures pluviales et assurez des systèmes de drainage appropriés.
rw: Iminsi 16 ikurikira: Witegure igi cy'imvura. Tekereza gutera ibihingwa by'imvura kandi usuzume ko ufite imiyoboro y'amazi myiza.

# drySeasonAheadTitle
source: Dry Season Ahead
fr: Saison Sèche à Venir
rw: Igi cy'Umusaruro Kigeze

# drySeasonAheadBody
source: Next 16 days: Dry weather expected. Plan irrigation systems and consider drought-resistant crops. Store water for livestock.
fr: 16 prochains jours : Temps sec attendu. Planifiez les systèmes d'irrigation et considérez des cultures résistantes à la sécheresse. Stockez l'eau pour le bétail.
rw: Iminsi 16 ikurikira: Igi cy'umusaruro kigeze. Tekereza gutera ibihingwa bitinyuka umusaruro kandi ubike amazi y'amatungo.

# summerHeatAheadTitle
source: Summer Heat Coming
fr: Chaleur Estivale à Venir
rw: Ubushyuhe bw'Icyumweru Bugeze

# summerHeatAheadBody
source: Next 16 days: Hot summer months approaching. Plan for heat-resistant crops and ensure adequate shade for livestock.
fr: 16 prochains jours : Mois d'été chauds approchent. Planifiez des cultures résistantes à la chaleur et assurez une ombre adéquate pour le bétail.
rw: Iminsi 16 ikurikira: Ibihe by'ubushyuhe bigeze. Tekereza gutera ibihingwa bitinyuka ubushyuhe kandi usuzume ko amatungo afite igicucu.

# coldSeasonAheadTitle
source: Cold Season Ahead
fr: Saison Froide à Venir
rw: Igi cy'Ubukonje Kigeze

# coldSeasonAheadBody
source: Next 16 days: Cold weather approaching. Protect sensitive crops and ensure livestock have warm shelter.
fr: 16 prochains jours : Temps froid approche. Protégez les cultures sensibles et assurez un abri chaud pour le bétail.
rw: Iminsi 16 ikurikira: Igi cy'ubukonje kigeze. Kiraka ibihingwa byoroshye kandi usuzume ko amatungo afite ubwihisho bw'ubukonje.

# plantingSeasonTitle
source: Optimal Planting Time
fr: Temps Optimal de Plantation
rw: Igi Gikwiye cyo Gutera

# plantingSeasonBody
source: Next 16 days: Weather conditions are favorable for planting. Consider starting your crop cycle now.
fr: 16 prochains jours : Les conditions météorologiques sont favorables pour la plantation. Considérez commencer votre cycle de culture maintenant.
rw: Iminsi 16 ikurikira: Ibihe byo gutera bihagije. Tekereza gutangira gutera ibihingwa ubu.

# harvestingSeasonTitle
source: Harvesting Time
fr: Temps de Récolte
rw: Igi cy'Igihingwa

# harvestingSeasonBody
source: Next 16 days: Optimal conditions for harvesting. Plan your harvest activities during this period.
fr: 16 prochains jours : Conditions optimales pour la récolte. Planifiez vos activités de récolte pendant cette période.
rw: Iminsi 16 ikurikira: Ibihe bihagije byo guhinga. Tekereza igi cyo guhinga.

# irrigationNeededTitle
source: Irrigation Planning
fr: Planification d'Irrigation
rw: Gutegura Amazi

# irrigationNeededBody
source: Next 16 days: Low rainfall expected. Plan irrigation schedules and water conservation measures.
fr: 16 prochains jours : Faibles précipitations attendues. Planifiez les horaires d'irrigation et les mesures de conservation d'eau.
rw: Iminsi 16 ikurikira: Imvura nto yitezwe. Tekereza gutegura amazi kandi ubike amazi.

# pestControlTitle
source: Pest Control Alert
fr: Alerte de Lutte Antiparasitaire
rw: Impuruza y'Ibikoko

# pestControlBody
source: Next 16 days: Weather conditions may favor pest development. Monitor crops and plan pest control measures.
fr: 16 prochains jours : Les conditions météorologiques peuvent favoriser le développement des parasites. Surveillez les cultures et planifiez les mesures de lutte antiparasitaire.
rw: Iminsi 16 ikurikira: Ibihe bishobora gutera ibikoko. Reba ibihingwa kandi utegure uko ubirwanya.

# prioritySevere
source: SEVERE
fr: GRAVE
rw: BIKOMEYE

# priorityAdvisory
source: ADVISORY
fr: AVIS
rw: INAMA

# priorityTip
source: TIP
fr: CONSEIL
rw: INAMA

# priorityFarming
source: FARMING
fr: AGRICULTURE
rw: UBUHINZI

source: City not found
fr: Ville non trouvée
rw: Umujyi ntabashije kuboneka

# locationServicesDisabled
source: Location services are disabled.
fr: Les services de localisation sont désactivés.
rw: Serivisi zo kumenya aho uherereye zirangiye.

source: Location permission denied forever.
fr: Autorisation de localisation refusée définitivement.
rw: Ururembo rwo kumenya aho uherereye rwanze burundu.

source: High
fr: Élevé
rw: Hejuru

source: Low
fr: Bas
rw: Hasi

# sunriseTime
source: Sunrise
fr: Lever du soleil
rw: Izuba Rirashe

# sunsetTime
source: Sunset
fr: Coucher du soleil
rw: Izuba Rirenga

# farmingPredictionCardTitle
source: 16-Day Farming Outlook
fr: Prévisions agricoles sur 16 jours
rw: Iteganyagihe ry'ubuhinzi ry'iminsi 16

source: Avg. Temp (16 days)
fr: Temp. moyenne (16 jours)
rw: Impuzandengo y'ubushyuhe (iminsi 16)

# avgRainfall16Days
source: Avg. Rainfall Chance (16 days)
fr: Chance de pluie moy. (16 jours)
rw: Amahirwe y'imvura (iminsi 16)

source: Primary Recommendation
fr: Recommandation principale
rw: Inama y'ibanze

# defaultRecommendation
source: Plan according to moderate weather conditions.
fr: Planifiez en fonction de conditions météorologiques modérées.
rw: Teganya ibikorwa byawe ukurikije uko ikirere kiri.

# farmingAnalysisUnavailable
source: Farming analysis data is not available.
fr: Les données d'analyse agricole ne sont pas disponibles.
rw: Amakuru y'isesengura ry'ubuhinzi ntari aboneka.

source: AI Weather Insights
fr: Aperçus météo IA

source: Weather Summary
fr: Résumé météo

source: Activity Suggestions
fr: Suggestions d'activités

source: Clothing Recommendations
fr: Recommandations vestimentaires

source: Generating AI insights...
fr: Génération des aperçus IA...

source: Retry
fr: Réessayer

# aiInsightsError
source: Unable to load AI insights
fr: Impossible de charger les aperçus IA

# french
source: Français
rw: Igifaransa
